BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/timer_irq.c
/******************************************************************************
	timer_irq.c
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License
Hardware: STM32-XXX
Date:     05062026
Comment:
	
*******************************************************************************/
#include "timer_irq.h"
#include "stm32_irq.h"
#include <stm32g4xx.h>

/********************************************************************
 * TIM1
 ********************************************************************/

void tim1_u_callback(void) {}
void tim1_cc1_callback(void) {}
void tim1_cc2_callback(void) {}
void tim1_cc3_callback(void) {}
void tim1_cc4_callback(void) {}
void tim1_trg_callback(void) {}
void tim1_brk_callback(void) {}
void tim1_brk2_callback(void) {}
void tim1_com_callback(void) {}

/********************************************************************
 * TIM8
 ********************************************************************/

void tim8_u_callback(void) {}
void tim8_cc1_callback(void) {}
void tim8_cc2_callback(void) {}
void tim8_cc3_callback(void) {}
void tim8_cc4_callback(void) {}
void tim8_trg_callback(void) {}
void tim8_brk_callback(void) {}
void tim8_com_callback(void) {}
void tim8_rep_callback(void) {}
void tim8_dma_callback(void) {}

/********************************************************************
 * TIM2–TIM5 (GENERAL PURPOSE)
 ********************************************************************/

void tim2_u_callback(void) {}
void tim2_cc1_callback(void) {}
void tim2_cc2_callback(void) {}
void tim2_cc3_callback(void) {}
void tim2_cc4_callback(void) {}

void tim3_u_callback(void) {}
void tim3_cc1_callback(void) {}
void tim3_cc2_callback(void) {}
void tim3_cc3_callback(void) {}
void tim3_cc4_callback(void) {}

void tim4_u_callback(void) {}
void tim4_cc1_callback(void) {}
void tim4_cc2_callback(void) {}
void tim4_cc3_callback(void) {}
void tim4_cc4_callback(void) {}

void tim5_u_callback(void) {}
void tim5_cc1_callback(void) {}
void tim5_cc2_callback(void) {}
void tim5_cc3_callback(void) {}
void tim5_cc4_callback(void) {}

/********************************************************************
 * TIM6–TIM7 (BASIC TIMERS)
 ********************************************************************/

void tim6_u_callback(void) {}
void tim7_u_callback(void) {}

/********************************************************************
 * TIM15–TIM17 (LOW POWER TIMERS)
 ********************************************************************/

void tim15_u_callback(void) {}
void tim15_cc1_callback(void) {}
void tim15_cc2_callback(void) {}
void tim15_trg_callback(void) {}
void tim15_com_callback(void) {}
void tim15_brk_callback(void) {}

void tim16_u_callback(void) {}
void tim16_cc1_callback(void) {}
void tim16_brk_callback(void) {}

void tim17_u_callback(void) {}
void tim17_cc1_callback(void) {}
void tim17_brk_callback(void) {}

/********************************************************************
 * TIM20 (ADVANCED / HIGH RESOLUTION)
 ********************************************************************/

void tim20_u_callback(void) {}
void tim20_cc1_callback(void) {}
void tim20_cc2_callback(void) {}
void tim20_cc3_callback(void) {}
void tim20_cc4_callback(void) {}
void tim20_trg_callback(void) {}
void tim20_brk_callback(void) {}
void tim20_brk2_callback(void) {}
void tim20_com_callback(void) {}

/********************************************************************
 * TIM1 (ADVANCED TIMER)
 ********************************************************************/
void TIM1_BRK_TIM15_IRQHandler(void)
{
    uint32_t sr;

    /****************************************************************
     * TIM1
     ****************************************************************/
    sr = TIM1->SR;

    /* Break */
    if (sr & TIM_SR_BIF)
    {
        CLEAR_BIT(TIM1->SR, TIM_SR_BIF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->break_event != NULL)
        {
            irq()->tim->tim1->break_event();
        }
        else
        {
            tim1_brk_callback();
        }
    }

    /* Break 2 (STM32G4) */
    if (sr & TIM_SR_B2IF)
    {
        CLEAR_BIT(TIM1->SR, TIM_SR_B2IF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->break2 != NULL)
        {
            irq()->tim->tim1->break2();
        }
        else
        {
            tim1_brk2_callback();
        }
    }

    /****************************************************************
     * TIM15
     ****************************************************************/
    sr = TIM15->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM15->SR, TIM_SR_UIF);

        /* Bus synchronization barrier */
        (void)TIM15->SR;

        if (irq()->tim->tim15->update != NULL)
        {
            irq()->tim->tim15->update();
        }
        else
        {
            tim15_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM15->SR, TIM_SR_CC1IF);

        /* Bus synchronization barrier */
        (void)TIM15->SR;

        if (irq()->tim->tim15->cc1 != NULL)
        {
            irq()->tim->tim15->cc1();
        }
        else
        {
            tim15_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM15->SR, TIM_SR_CC2IF);

        /* Bus synchronization barrier */
        (void)TIM15->SR;

        if (irq()->tim->tim15->cc2 != NULL)
        {
            irq()->tim->tim15->cc2();
        }
        else
        {
            tim15_cc2_callback();
        }
    }

    /* Trigger */
    if (sr & TIM_SR_TIF)
    {
        CLEAR_BIT(TIM15->SR, TIM_SR_TIF);

        /* Bus synchronization barrier */
        (void)TIM15->SR;

        if (irq()->tim->tim15->trigger != NULL)
        {
            irq()->tim->tim15->trigger();
        }
        else
        {
            tim15_trg_callback();
        }
    }

    /* Commutation */
    if (sr & TIM_SR_COMIF)
    {
        CLEAR_BIT(TIM15->SR, TIM_SR_COMIF);

        /* Bus synchronization barrier */
        (void)TIM15->SR;

