BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/timer_irq.c
        if (irq()->tim->tim15->commutation != NULL)
        {
            irq()->tim->tim15->commutation();
        }
        else
        {
            tim15_com_callback();
        }
    }

    /* Break */
    if (sr & TIM_SR_BIF)
    {
        CLEAR_BIT(TIM15->SR, TIM_SR_BIF);

        /* Bus synchronization barrier */
        (void)TIM15->SR;

        if (irq()->tim->tim15->break_event != NULL)
        {
            irq()->tim->tim15->break_event();
        }
        else
        {
            tim15_brk_callback();
        }
    }
}

void TIM1_UP_TIM16_IRQHandler(void)
{
    uint32_t sr;

    /****************************************************************
     * TIM1
     ****************************************************************/
    sr = TIM1->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM1->SR, TIM_SR_UIF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->update != NULL)
        {
            irq()->tim->tim1->update();
        }
        else
        {
            tim1_u_callback();
        }
    }

    /****************************************************************
     * TIM16
     ****************************************************************/
    sr = TIM16->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM16->SR, TIM_SR_UIF);

        /* Bus synchronization barrier */
        (void)TIM16->SR;

        if (irq()->tim->tim16->update != NULL)
        {
            irq()->tim->tim16->update();
        }
        else
        {
            tim16_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM16->SR, TIM_SR_CC1IF);

        /* Bus synchronization barrier */
        (void)TIM16->SR;

        if (irq()->tim->tim16->cc1 != NULL)
        {
            irq()->tim->tim16->cc1();
        }
        else
        {
            tim16_cc1_callback();
        }
    }

    /* Break */
    if (sr & TIM_SR_BIF)
    {
        CLEAR_BIT(TIM16->SR, TIM_SR_BIF);

        /* Bus synchronization barrier */
        (void)TIM16->SR;

        if (irq()->tim->tim16->break_event != NULL)
        {
            irq()->tim->tim16->break_event();
        }
        else
        {
            tim16_brk_callback();
        }
    }
}

void TIM1_TRG_COM_TIM17_IRQHandler(void)
{
    uint32_t sr;

    /****************************************************************
     * TIM1
     ****************************************************************/
    sr = TIM1->SR;

    /* Trigger */
    if (sr & TIM_SR_TIF)
    {
        CLEAR_BIT(TIM1->SR, TIM_SR_TIF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->trigger != NULL)
        {
            irq()->tim->tim1->trigger();
        }
        else
        {
            tim1_trg_callback();
        }
    }

    /* Commutation */
    if (sr & TIM_SR_COMIF)
    {
        CLEAR_BIT(TIM1->SR, TIM_SR_COMIF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->commutation != NULL)
        {
            irq()->tim->tim1->commutation();
        }
        else
        {
            tim1_com_callback();
        }
    }

    /****************************************************************
     * TIM17
     ****************************************************************/
    sr = TIM17->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM17->SR, TIM_SR_UIF);

        /* Bus synchronization barrier */
        (void)TIM17->SR;

        if (irq()->tim->tim17->update != NULL)
        {
            irq()->tim->tim17->update();
        }
        else
        {
            tim17_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM17->SR, TIM_SR_CC1IF);

        /* Bus synchronization barrier */
        (void)TIM17->SR;

        if (irq()->tim->tim17->cc1 != NULL)
        {
            irq()->tim->tim17->cc1();
        }
        else
        {
            tim17_cc1_callback();
        }
    }

    /* Break */
    if (sr & TIM_SR_BIF)
    {
        CLEAR_BIT(TIM17->SR, TIM_SR_BIF);

        /* Bus synchronization barrier */
        (void)TIM17->SR;

        if (irq()->tim->tim17->break_event != NULL)
        {
            irq()->tim->tim17->break_event();
        }
        else
        {
            tim17_brk_callback();
        }
    }
}

void TIM1_CC_IRQHandler(void)
{
    uint32_t sr = TIM1->SR;

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
    	CLEAR_BIT(TIM1->SR, TIM_SR_CC1IF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->cc1 != NULL)
        {
            irq()->tim->tim1->cc1();
        }
        else
        {
            tim1_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
    	CLEAR_BIT(TIM1->SR, TIM_SR_CC2IF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->cc2 != NULL)
        {
            irq()->tim->tim1->cc2();
        }
        else
        {
            tim1_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
    	CLEAR_BIT(TIM1->SR, TIM_SR_CC3IF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->cc3 != NULL)
        {
            irq()->tim->tim1->cc3();
        }
        else
        {
            tim1_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
    	CLEAR_BIT(TIM1->SR, TIM_SR_CC4IF);

        /* Bus synchronization barrier */
        (void)TIM1->SR;

        if (irq()->tim->tim1->cc4 != NULL)
        {
            irq()->tim->tim1->cc4();
        }
        else
        {
            tim1_cc4_callback();
        }
    }
}

/********************************************************************
 * TIM8 (ADVANCED TIMER)
 ********************************************************************/
void TIM8_BRK_IRQHandler(void)
{
    uint32_t sr = TIM8->SR;

    /* Break */
    if (sr & TIM_SR_BIF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_BIF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->break_event != NULL)
        {
            irq()->tim->tim8->break_event();
        }
        else
        {
            tim8_brk_callback();
        }
    }
}

void TIM8_UP_IRQHandler(void)
{
    uint32_t sr = TIM8->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_UIF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->update != NULL)
        {
            irq()->tim->tim8->update();
        }
        else
        {
            tim8_u_callback();
        }
    }
}

void TIM8_TRG_COM_IRQHandler(void)
{
    uint32_t sr = TIM8->SR;

    /* Trigger */
    if (sr & TIM_SR_TIF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_TIF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->trigger != NULL)
        {
            irq()->tim->tim8->trigger();
        }
        else
        {
            tim8_trg_callback();
        }
    }

    /* Commutation */
    if (sr & TIM_SR_COMIF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_COMIF);
        (void)TIM8->SR;

