BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/timer_irq.c
        if (irq()->tim->tim8->commutation != NULL)
        {
            irq()->tim->tim8->commutation();
        }
        else
        {
            tim8_com_callback();
        }
    }
}

void TIM8_CC_IRQHandler(void)
{
    uint32_t sr = TIM8->SR;

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_CC1IF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->cc1 != NULL)
        {
            irq()->tim->tim8->cc1();
        }
        else
        {
            tim8_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_CC2IF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->cc2 != NULL)
        {
            irq()->tim->tim8->cc2();
        }
        else
        {
            tim8_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_CC3IF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->cc3 != NULL)
        {
            irq()->tim->tim8->cc3();
        }
        else
        {
            tim8_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
        CLEAR_BIT(TIM8->SR, TIM_SR_CC4IF);
        (void)TIM8->SR;

        if (irq()->tim->tim8->cc4 != NULL)
        {
            irq()->tim->tim8->cc4();
        }
        else
        {
            tim8_cc4_callback();
        }
    }
}

/********************************************************************
 * TIM2–TIM5 (GENERAL PURPOSE TIMERS)
 ********************************************************************/
void TIM2_IRQHandler(void)
{
    uint32_t sr = TIM2->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM2->SR, TIM_SR_UIF);
        (void)TIM2->SR;

        if (irq()->tim->tim2->update != NULL)
        {
            irq()->tim->tim2->update();
        }
        else
        {
            tim2_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM2->SR, TIM_SR_CC1IF);
        (void)TIM2->SR;

        if (irq()->tim->tim2->cc1 != NULL)
        {
            irq()->tim->tim2->cc1();
        }
        else
        {
            tim2_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM2->SR, TIM_SR_CC2IF);
        (void)TIM2->SR;

        if (irq()->tim->tim2->cc2 != NULL)
        {
            irq()->tim->tim2->cc2();
        }
        else
        {
            tim2_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
        CLEAR_BIT(TIM2->SR, TIM_SR_CC3IF);
        (void)TIM2->SR;

        if (irq()->tim->tim2->cc3 != NULL)
        {
            irq()->tim->tim2->cc3();
        }
        else
        {
            tim2_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
        CLEAR_BIT(TIM2->SR, TIM_SR_CC4IF);
        (void)TIM2->SR;

        if (irq()->tim->tim2->cc4 != NULL)
        {
            irq()->tim->tim2->cc4();
        }
        else
        {
            tim2_cc4_callback();
        }
    }
}

void TIM3_IRQHandler(void)
{
    uint32_t sr = TIM3->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM3->SR, TIM_SR_UIF);
        (void)TIM3->SR;

        if (irq()->tim->tim3->update != NULL)
        {
            irq()->tim->tim3->update();
        }
        else
        {
            tim3_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM3->SR, TIM_SR_CC1IF);
        (void)TIM3->SR;

        if (irq()->tim->tim3->cc1 != NULL)
        {
            irq()->tim->tim3->cc1();
        }
        else
        {
            tim3_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM3->SR, TIM_SR_CC2IF);
        (void)TIM3->SR;

        if (irq()->tim->tim3->cc2 != NULL)
        {
            irq()->tim->tim3->cc2();
        }
        else
        {
            tim3_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
        CLEAR_BIT(TIM3->SR, TIM_SR_CC3IF);
        (void)TIM3->SR;

        if (irq()->tim->tim3->cc3 != NULL)
        {
            irq()->tim->tim3->cc3();
        }
        else
        {
            tim3_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
        CLEAR_BIT(TIM3->SR, TIM_SR_CC4IF);
        (void)TIM3->SR;

        if (irq()->tim->tim3->cc4 != NULL)
        {
            irq()->tim->tim3->cc4();
        }
        else
        {
            tim3_cc4_callback();
        }
    }
}

void TIM4_IRQHandler(void)
{
    uint32_t sr = TIM4->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM4->SR, TIM_SR_UIF);
        (void)TIM4->SR;

        if (irq()->tim->tim4->update != NULL)
        {
            irq()->tim->tim4->update();
        }
        else
        {
            tim4_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM4->SR, TIM_SR_CC1IF);
        (void)TIM4->SR;

        if (irq()->tim->tim4->cc1 != NULL)
        {
            irq()->tim->tim4->cc1();
        }
        else
        {
            tim4_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM4->SR, TIM_SR_CC2IF);
        (void)TIM4->SR;

        if (irq()->tim->tim4->cc2 != NULL)
        {
            irq()->tim->tim4->cc2();
        }
        else
        {
            tim4_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
        CLEAR_BIT(TIM4->SR, TIM_SR_CC3IF);
        (void)TIM4->SR;

        if (irq()->tim->tim4->cc3 != NULL)
        {
            irq()->tim->tim4->cc3();
        }
        else
        {
            tim4_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
        CLEAR_BIT(TIM4->SR, TIM_SR_CC4IF);
        (void)TIM4->SR;

        if (irq()->tim->tim4->cc4 != NULL)
        {
            irq()->tim->tim4->cc4();
        }
        else
        {
            tim4_cc4_callback();
        }
    }
}

