BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/timer_irq.c
void TIM5_IRQHandler(void)
{
    uint32_t sr = TIM5->SR;

    /* Update */
    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM5->SR, TIM_SR_UIF);
        (void)TIM5->SR;

        if (irq()->tim->tim5->update != NULL)
        {
            irq()->tim->tim5->update();
        }
        else
        {
            tim5_u_callback();
        }
    }

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM5->SR, TIM_SR_CC1IF);
        (void)TIM5->SR;

        if (irq()->tim->tim5->cc1 != NULL)
        {
            irq()->tim->tim5->cc1();
        }
        else
        {
            tim5_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM5->SR, TIM_SR_CC2IF);
        (void)TIM5->SR;

        if (irq()->tim->tim5->cc2 != NULL)
        {
            irq()->tim->tim5->cc2();
        }
        else
        {
            tim5_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
        CLEAR_BIT(TIM5->SR, TIM_SR_CC3IF);
        (void)TIM5->SR;

        if (irq()->tim->tim5->cc3 != NULL)
        {
            irq()->tim->tim5->cc3();
        }
        else
        {
            tim5_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
        CLEAR_BIT(TIM5->SR, TIM_SR_CC4IF);
        (void)TIM5->SR;

        if (irq()->tim->tim5->cc4 != NULL)
        {
            irq()->tim->tim5->cc4();
        }
        else
        {
            tim5_cc4_callback();
        }
    }
}

/********************************************************************
 * TIM6–TIM7 (BASIC TIMERS)
 ********************************************************************/
void TIM6_IRQHandler(void)
{
    uint32_t sr = TIM6->SR;

    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM6->SR, TIM_SR_UIF);
        (void)TIM6->SR;

        if (irq()->tim->tim6->update)
            irq()->tim->tim6->update();
        else
            tim6_u_callback();
    }
}

void TIM7_IRQHandler(void)
{
	uint32_t sr = TIM7->SR;

    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM7->SR, TIM_SR_UIF);
        (void)TIM7->SR;

        if (irq()->tim->tim7->update != NULL)
        {
            irq()->tim->tim7->update();
        }
        else
        {
            tim7_u_callback();
        }
    }
}

/********************************************************************
 * TIM20 (ADVANCED TIMER - G473)
 ********************************************************************/
void TIM20_UP_IRQHandler(void)
{
	uint32_t sr = TIM20->SR;

    if (sr & TIM_SR_UIF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_UIF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->update != NULL)
        {
            irq()->tim->tim20->update();
        }
        else
        {
            tim20_u_callback();
        }
    }
}

void TIM20_CC_IRQHandler(void)
{
    uint32_t sr = TIM20->SR;

    /* Capture / Compare 1 */
    if (sr & TIM_SR_CC1IF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_CC1IF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->cc1 != NULL)
        {
            irq()->tim->tim20->cc1();
        }
        else
        {
            tim20_cc1_callback();
        }
    }

    /* Capture / Compare 2 */
    if (sr & TIM_SR_CC2IF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_CC2IF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->cc2 != NULL)
        {
            irq()->tim->tim20->cc2();
        }
        else
        {
            tim20_cc2_callback();
        }
    }

    /* Capture / Compare 3 */
    if (sr & TIM_SR_CC3IF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_CC3IF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->cc3 != NULL)
        {
            irq()->tim->tim20->cc3();
        }
        else
        {
            tim20_cc3_callback();
        }
    }

    /* Capture / Compare 4 */
    if (sr & TIM_SR_CC4IF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_CC4IF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->cc4 != NULL)
        {
            irq()->tim->tim20->cc4();
        }
        else
        {
            tim20_cc4_callback();
        }
    }
}

void TIM20_TRG_IRQHandler(void)
{
    uint32_t sr = TIM20->SR;

    /* Trigger */
    if (sr & TIM_SR_TIF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_TIF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->trigger != NULL)
        {
            irq()->tim->tim20->trigger();
        }
        else
        {
            tim20_trg_callback();
        }
    }

    /* Commutation */
    if (sr & TIM_SR_COMIF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_COMIF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->commutation != NULL)
        {
            irq()->tim->tim20->commutation();
        }
        else
        {
            tim20_com_callback();
        }
    }
}

void TIM20_BRK_IRQHandler(void)
{
    uint32_t sr = TIM20->SR;

    /* Break */
    if (sr & TIM_SR_BIF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_BIF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->break_event != NULL)
        {
            irq()->tim->tim20->break_event();
        }
        else
        {
            tim20_brk_callback();
        }
    }

    /* Break 2 */
    if (sr & TIM_SR_B2IF)
    {
        CLEAR_BIT(TIM20->SR, TIM_SR_B2IF);
        (void)TIM20->SR;

        if (irq()->tim->tim20->break2 != NULL)
        {
            irq()->tim->tim20->break2();
        }
        else
        {
            tim20_brk2_callback();
        }
    }
}

/*** EOF ***/

